{
"id":2,
"url":"",
"guid":"080FFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Delphi-Cookbook-Second-Edition.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Delphi Cookbook - Second Edition",
"lang":"en",
"pubdate":"20160630",
"thumb":"",
"isbn10":"",
"isbn13":"9781785287428",
"website":"https:\/\/www.packtpub.com\/product\/delphi-cookbook-second-edition\/9781785287428",
"cover":"",
"cover_100w":"",
"cover_150w":"",
"cover_200w":"",
"cover_300w":"",
"cover_400w":"",
"cover_500w":"",
"cover_100h":"",
"cover_200h":"",
"cover_300h":"",
"cover_400h":"",
"cover_500h":"",
"cover_100x100":"",
"cover_200x200":"",
"cover_300x300":"",
"cover_400x400":"",
"cover_500x500":"",
"cover_130x110":"",
"authors":[
{
"id":6,
"url":"",
"guid":"000DFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Daniele-Teti.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true,
"name":""}],
"publishers":[
{
"id":2,
"url":"",
"guid":"1A0BFDB8DA18EE118C5C32A5A9F17050",
"pagename":"Packt.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"Packt"}],
"descriptions":[
{
"guid":"8A0FFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"Delphi is a cross-platform Integrated Development Environment (IDE) that supports rapid application development for Microsoft Windows, Apple Mac OS X, Google Android, and Apple iOS. It helps you to concentrate on the real business and save yourself the pain of wandering amid GUI widget details, or having to tackle inter-platform incompatibilities. It also has a wide range of drag-and-drop controls, helping you code your business logic into your business model, and it compiles natively for desktop and mobile platforms.\n\nThis book will teach you how to design and develop applications, deploy them on the cloud platform, and distribute them within an organization via Google Play and other similar platforms.\n\nYou will begin with the basics of Delphi and get acquainted with JSON format strings, XSLT transformations, unicode encodings and various types of streams. We then move on to more advanced topics such as developing higher-order functions and using enumerators and RTTI. You will get an understanding of how Delphi RTL functions and how to use FireMonkey in a VCL application. We will then cover topics such as multithreading, using the parallel programming library and putting Delphi on a server. We will also take a look at the new feature of WebBroker Apache modules and then ride the mobile revolution with FireMonkey.\n\nBy the end of the book, you will be able to develop and deploy cross-platform applications using Delphi."}],
"tocs":[
],
"keywords":[
]}