{
"id":133,
"guid":"085803CDF27E4023A28C4E2AA3B92EF4",
"pagename":"DELPHI-IN-DEPTH-DATASNAP.html",
"datalevel":8,
"dataversion":1,
"name":"DELPHI IN DEPTH DATASNAP 網站應用程式全端開發: 晋升全端開發領域的最佳指南！",
"lang":"cn",
"pubdate":"20200729",
"isbn10":"9789869530019",
"isbn13":"9789869530019",
"website":"https:\/\/books.google.fr\/books?id=jr30dwaaqbaj",
"authors":[
{
"id":80,
"guid":"36DBFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Eden-Wu.html",
"datalevel":7,
"dataversion":1}],
"publishers":[
],
"descriptions":[
{
"guid":"04BF4AE1C5024A75811BCF4F05454E0E",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"cn",
"text":"內容簡介\r\n\r\n讓你從 0 到 1 進入全端開發領域，掌握後端知識同時也學會前端開發訣竅，點開 Web 開發新技能\r\n\r\n\r\n\r\nDelphi 進階框架 -- DataSnap 全方位構築後端知識。\r\n\r\njQuery EasyUI 前端技術內涵及接近 VCL 元件的操作概念。\r\n\r\n資料庫常用操作。\r\n\r\n涵蓋語法入門，元件介紹等前後端整合實戰應用。\r\n\r\n\r\n\r\n給需要本書的人：\r\n\r\n★有接觸過 JavaScript 卻不知道如何開始才能點開後端技能的人\r\n\r\n★有接觸過 Delphi 但又不想打掉重練的人\r\n\r\n★老是寫不好 Delphi 程式的人\r\n\r\n★想運用 DataSnap 開發全端專案的人\r\n\r\n\r\n\r\n\r\n\r\n本書特色\r\n\r\n\r\n\r\n1.本書採漸進式開發後台管理系統的全端網站應用程式，讓學習者能馬上做，立即學。\r\n\r\n2.全書程式碼毫無保留的呈現，重點處還會節錄再說明，更加強化理解與記憶內容。\r\n\r\n3.提供關於框架原理的圖說，讓讀者更能聚焦學習重點上。\r\n\r\n4.實作成品能立即應用在實戰中，實現超速學習成果。\r\n\r\n\r\n\r\n專文推薦\r\n\r\n\r\n\r\nEden 是我見過對 Delphi 最有愛的工程師，沒有之一。__【Delphi.KTOP 資深版主 Jason Wong】\r\n\r\n\r\n\r\nEden 的堅持，是目前台灣地區 Delphi 不可或缺的精神，我從這本書裡面看到 Eden 的用心。__【Indy TIdDNSServer、Delphi \/ Kylix -Indy 網路程式設計作者 張子仁】\r\n\r\n\r\n\r\n本書從前端的 Javascript 說起，漸近地深入後端 DataSnap 實作，最後將前後端串起來，這樣的佈局，尤其對全端不熟的開發者而言，相信可以很快速的入門與應用 ！__【Delphi.KTOP 副站長 蕭沖】"
},{

"guid":"154D716675CE4870B3758C55B84D7CC0",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"Content introduction\r\n\r\nLet you enter the full-end development field from 0 to 1, master the back-end knowledge and learn the front-end development tips at the same time, and click on the new skills of Web development.\r\n\r\nDelphi advanced framework -- DataSnap builds back-end knowledge in an all-round way.\r\n\r\njQuery EasyUI front-end technical connotation and operation concept close to VCL components.\r\n\r\nCommon operation of database.\r\n\r\nIt covers the front-end and back-end integrated practical applications such as grammar introduction, component introduction, etc.\r\n\r\nFor those who need this book:\r\n\r\n★ People who have been exposed to JavaScript but don't know how to start to click on back-end skills\r\n\r\n★ There are people who have been in contact with Delphi but don't want to kill the retraining.\r\n\r\n★ People who can't write Delphi programs well\r\n\r\n★ People who want to use DataSnap to develop full-end projects\r\n\r\nFeatures of this book\r\n\r\n1. This book adopts the progressive development of the full-end website application of the back-end management system, so that learners can do it immediately and learn immediately.\r\n\r\n2. The code of the whole book is presented without reservation, and the key points will be excerpted and explained to strengthen the understanding and memory content.\r\n\r\n3. Provide diagrams about the principle of the framework, so that readers can focus more on learning.\r\n\r\n4. The actual product can be immediately applied to the actual battle to achieve the results of speeding learning.\r\n\r\nRecommendation of articles\r\n\r\nEden is one of the most loving engineers I have ever seen for Delphi. __[Delphi.KTOP Senior Moderator Jason Wong]\r\n\r\nEden's persistence is the indispensable spirit of Delphi in Taiwan at present. I can see Eden's intentions in this book. __ [Indy TIdDNSServer, Delphi \/ Kylix -Indy Network Programming Author Zhang Ziren]\r\n\r\nThis book starts with the front-end Javascript, gradually goes deep into the back-end DataSnap implementation, and finally strings the front and back ends. Such a layout, especially for developers who are not familiar with the whole end, is believed to be a very fast start and application! __[Delphi.KTOP Deputy Station Manager Xiao Chong]"
},{

"guid":"2282737AF67D4C7E904F987D77C2BC28",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"fr",
"text":"Introduction du contenu\r\n\r\nLaissez-vous entrer dans le domaine du développement complet de 0 à 1, maîtrisez les connaissances du back-end et apprenez les conseils de développement front-end en même temps, et cliquez sur les nouvelles compétences du développement Web.\r\n\r\nCadre avancé Delphi -- DataSnap construit les connaissances back-end de manière globale.\r\n\r\nConnotation technique frontale jQuery EasyUI et concept d'exploitation proche des composants VCL.\r\n\r\nFonctionnement commun de la base de données.\r\n\r\nIl couvre les applications pratiques intégrées front-end et back-end telles que l'introduction de la grammaire, l'introduction de composants, etc.\r\n\r\nPour ceux qui ont besoin de ce livre :\r\n\r\n★ Les personnes qui ont été exposées à JavaScript mais qui ne savent pas comment commencer à cliquer sur les compétences du back-end\r\n\r\n★ Il y a des gens qui ont été en contact avec Delphi mais qui ne veulent pas tuer le recyclage.\r\n\r\n★ Les personnes qui ne peuvent pas bien écrire les programmes Delphi\r\n\r\n★ Les personnes qui veulent utiliser DataSnap pour développer des projets complets\r\n\r\nCaractéristiques de ce livre\r\n\r\n1. Ce livre adopte le développement progressif de l'application de site Web complète du système de gestion back-end, afin que les apprenants puissent le faire immédiatement et apprendre immédiatement.\r\n\r\n2. Le code de l'ensemble du livre est présenté sans réserve, et les points clés seront extraits et expliqués pour renforcer la compréhension et le contenu de la mémoire.\r\n\r\n3. Fournir des diagrammes sur le principe du cadre, afin que les lecteurs puissent se concentrer davantage sur l'apprentissage.\r\n\r\n4. Le produit réel peut être immédiatement appliqué à la bataille réelle pour obtenir les résultats de l'apprentissage accéléré.\r\n\r\nRecommandation d'articles\r\n\r\nEden est l'un des ingénieurs les plus aimants que j'aie jamais vus pour Delphes. __[Delphi.KTOP Modérateur principal Jason Wong]\r\n\r\nLa persévérance d'Eden est l'esprit indispensable de Delphes à Taïwan à l'heure actuelle. Je peux voir les intentions d'Eden dans ce livre. __ [Indy TIdDNSServer, Delphi \/ Kylix -Indy Network Programming Author Zhang Ziren]\r\n\r\nCe livre commence par le Javascript frontal, approfondit progressivement l'implémentation Back-end de DataSnap, et enfin enchaîne les front et les back-ends. Une telle mise en page, en particulier pour les développeurs qui ne sont pas familiers avec toute la fin, est considérée comme un démarrage et une application très rapides ! __[Delphi.KTOP Directeur adjoint de la station Xiao Chong]"}],
"tocs":[
],
"keywords":[
]}