{
"id":15,
"url":"",
"guid":"2623FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Hands-on-with-Delphi-Volume-1.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Hands-on with Delphi - Volume 1",
"lang":"en",
"pubdate":"20200509",
"thumb":"",
"isbn10":"",
"isbn13":"9798634312415",
"website":"https:\/\/flixengineering.com\/archives\/1308",
"cover":"",
"cover_100w":"",
"cover_150w":"",
"cover_200w":"",
"cover_300w":"",
"cover_400w":"",
"cover_500w":"",
"cover_100h":"",
"cover_200h":"",
"cover_300h":"",
"cover_400h":"",
"cover_500h":"",
"cover_100x100":"",
"cover_200x200":"",
"cover_300x300":"",
"cover_400x400":"",
"cover_500x500":"",
"cover_130x110":"",
"authors":[
{
"id":13,
"url":"",
"guid":"9A22FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Dr-Holger-Flick.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true,
"name":""}],
"publishers":[
{
"id":5,
"url":"",
"guid":"F21EFDB8DA18EE118C5C32A5A9F17050",
"pagename":"FlixEngineering.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"FlixEngineering"}],
"descriptions":[
{
"guid":"B223FCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"Delphi has been established as one of the best software development tools for Windows desktop applications. Since its inception in 1995, it has constantly grown with the challenges of the IT industry. Today, applications often must be deployable to multiple platforms or mobile devices and offer non-proprietary interfaces for interaction with other software or hardware. TMS Software has been offering software components and products specifically designed for Delphi developers since the first version of Delphi. From recent seminars, conferences, and events TMS realized that practical examples how to make use of their components and products have the greatest learning effect. This idea lead to the Hands-on series.In this first book of the Hands-on series, several examples for a reproducible usage scenario are built.\n\nWrite a professional web service for a database with over 8 million records.\nDesign VCL, FireMonkey and TMS WEB Core web clients for multiple platforms and devices.\nImplement a reporting service with XData.\nGenerate signed PDF documents with a customizable template.\nAdd a token-based login to your services.\nBuild user interfaces with vector images to be ready for any display resolution.\nEncrypt sensitive data using modern algorithms.\nUse parallel programming to build responsive client applications.\nWrite better code with static code analysis.\nExamples use TMS FixInsight, FlexCel, FNC Core, FNC UI Pack, VCL UI Pack, WEB Core, and XData. Embarcadero Delphi Rio 10.3 or newer suggested. Trial versions suffice to run the example projects. MySQL is used as database server. Any other database can be used that is compatible with XData. Web\/XData basics explained in “TMS WEB Core: Web Application Development with Delphi” are not included again but referenced."}],
"tocs":[
],
"keywords":[
]}