{
"id":6,
"url":"",
"guid":"2A15FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Hands-On-Design-Patterns-with-Delphi.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Hands-On Design Patterns with Delphi",
"lang":"en",
"pubdate":"20190227",
"thumb":"",
"isbn10":"",
"isbn13":"9781789343243",
"website":"https:\/\/www.packtpub.com\/product\/hands-on-design-patterns-with-delphi\/9781789343243",
"cover":"",
"cover_100w":"",
"cover_150w":"",
"cover_200w":"",
"cover_300w":"",
"cover_400w":"",
"cover_500w":"",
"cover_100h":"",
"cover_200h":"",
"cover_300h":"",
"cover_400h":"",
"cover_500h":"",
"cover_100x100":"",
"cover_200x200":"",
"cover_300x300":"",
"cover_400x400":"",
"cover_500x500":"",
"cover_130x110":"",
"authors":[
{
"id":7,
"url":"",
"guid":"2213FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Primoz-Gabrijelcic.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true,
"name":""}],
"publishers":[
{
"id":2,
"url":"",
"guid":"1A0BFDB8DA18EE118C5C32A5A9F17050",
"pagename":"Packt.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"Packt"}],
"descriptions":[
{
"guid":"A215FCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"Design patterns have proven to be the go-to solution for many common programming scenarios. This book focuses on design patterns applied to the Delphi language. The book will provide you with insights into the language and its capabilities of a runtime library.\n\nYou'll start by exploring a variety of design patterns and understanding them through real-world examples. This will entail a short explanation of the concept of design patterns and the original set of the 'Gang of Four' patterns, which will help you in structuring your designs efficiently. Next, you'll cover the most important 'anti-patterns' (essentially bad software development practices) to aid you in steering clear of problems during programming. You'll then learn about the eight most important patterns for each creational, structural, and behavioral type. After this, you'll be introduced to the concept of 'concurrency' patterns, which are design patterns specifically related to multithreading and parallel computation. These will enable you to develop and improve an interface between items and harmonize shared memories within threads. Toward the concluding chapters, you'll explore design patterns specific to program design and other categories of patterns that do not fall under the 'design' umbrella.\n\nBy the end of this book, you'll be able to address common design problems encountered while developing applications and feel confident while building scalable projects."}],
"tocs":[
],
"keywords":[
]}