{
"id":138,
"guid":"2C528891895847509D51F5AC36A80E21",
"pagename":"Modern-Software-Development-with-Delphi.html",
"datalevel":7,
"dataversion":1,
"name":"Modern Software Development with Delphi",
"lang":"en",
"pubdate":"20231219",
"isbn13":"9798872288497",
"website":"https:\/\/www.holgerscode.com\/books\/2023\/12\/19\/modern-software-development-with-delphi\/",
"authors":[
{
"id":13,
"guid":"9A22FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Dr-Holger-Flick.html",
"datalevel":6,
"dataversion":1}],
"publishers":[
{
"id":5,
"guid":"F21EFDB8DA18EE118C5C32A5A9F17050",
"pagename":"FlixEngineering.html",
"datalevel":4,
"dataversion":1,
"label":"FlixEngineering"}],
"descriptions":[
{
"guid":"41DACAA6579E4CB58C3C4258EF86F002",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"<p>Learn to develop a desktop application, plus an API and an ORM<\/p><p><b>Dive into the World of Modern Software Development with Delphi!<\/b><\/p><p>Unlock the potential of Delphi programming and embark on a journey into the core of software development. This comprehensive guide is your key to crafting a non-trivial application using Delphi, equipped with TMS Aurelius Object-Relational Mapping (ORM) technology, TMS FlexCel for report generation, TMS XData for web service integration, and an exploration of modern techniques for robust application development. Discover the seamless fusion of traditional development and modern methodologies as you build an entity class model for your application first. Through step-by-step tutorials, delve into the intricacies of leveraging TMS Aurelius to harness the power of ORM, enabling compatibility with any database supported by Delphi, granting flexibility in your data management without writing SQL queries.<\/p><ul><li>Comprehensive guidance on building a non-trivial application with Delphi using TMS Aurelius for ORM<\/li><li>Creating an entity class model for flexible data management across various databases<\/li><li>Leveraging TMS FlexCel for dynamic report generation, including a preview, and exporting to PDF<\/li><li>Utilizing TMS XData for secure web services with token-based access control<\/li><li>Lightning-fast data reorganization and presentation with an in-memory database<\/li><li>Exploring modern language features of Delphi such as generics, interfaces, custom attributes, record helpers, and more<\/li><\/ul><p>Suitable for everyone interested in building software with Delphi using modern technologies. Dive into the concepts with downloadable source code, enabling you to accelerate your learning and implementation process. Whether you're a seasoned developer seeking to expand your toolkit or a newcomer to the world of Delphi, this book is your gateway to mastering modern software development. Elevate your projects, streamline your workflows, and unleash the true potential of Delphi.<\/p><p>This book extensively covers the use of TMS Aurelius, TMS FlexCel, and TMS XData. These are commercial products that require a license. However, fully functional trial versions of these tools are available, enabling you to follow the examples in the book and explore the functionalities.<\/p>"}],
"tocs":[
],
"keywords":[
]}