{
"id":64,
"url":"",
"guid":"308CFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Delphi-Programming-The-Ultimate-Beginners-Guide-to-Learn-Delphi-Programming-Step-by-Step.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Delphi Programming: The Ultimate Beginner's Guide to Learn Delphi Programming Step by Step",
"lang":"en",
"pubdate":"20201011",
"thumb":"",
"isbn10":"",
"isbn13":"",
"website":"https:\/\/amzn.to\/3jB1f5I",
"cover":"",
"cover_100w":"",
"cover_150w":"",
"cover_200w":"",
"cover_300w":"",
"cover_400w":"",
"cover_500w":"",
"cover_100h":"",
"cover_200h":"",
"cover_300h":"",
"cover_400h":"",
"cover_500h":"",
"cover_100x100":"",
"cover_200x200":"",
"cover_300x300":"",
"cover_400x400":"",
"cover_500x500":"",
"cover_130x110":"",
"authors":[
{
"id":53,
"url":"",
"guid":"E08BFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Rufus-Stewart.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true,
"name":""}],
"publishers":[
{
"id":7,
"url":"",
"guid":"682BFDB8DA18EE118C5C32A5A9F17050",
"pagename":"Amazon-Kindle.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"Amazon"}],
"descriptions":[
{
"guid":"9E8CFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"<p>The development of personal desktop computers led to the introduction of multi-tasking, multi-user operating systems such as Microsoft Windows. However, as a result, the process of creating software has become much more complicated. Visual integrated development environments (IDE) and rapid application development (RAD) systems were created by market leaders to facilitate the interaction with operating systems, reduce coding time, and improve the quality of the code.<\/p>\n<p>Visual Programming is a process of building software applications in which a user can simultaneously design, edit, debug and test the app using Visual IDE. In other words, Visual Programming is a combination of two interconnected processes: designing an application window visually; and writing the code.<\/p>\n<p>Delphi, a powerful Pascal compiler with a number of significant improvements for creating Windows applications, was first released in 1996.<\/p>\n<p>It is a high-level software development system with an integrated tool set for developing complete applications; it is a tool for rapid application development. Visual design and event-based programming concepts are the pillars of Delphi ideology. Using those concepts significantly improves application design processes and greatly reduces development time.<\/p>\n<p>Visual design allows users to lay out the application and see the results of the process prior to even starting the actual program. There are other benefits too: to assign a property value to a control or element of the app, it is not necessary to write multiple lines of code. All it takes is to change that value in a Properties window. This change will automatically generate or update the code.<\/p>"}],
"tocs":[
{
"guid":"D08CFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"<p>INTRODUCTION<\/p>\n<p>SECTION 1. INTRODUCTION TO DELPHI PROGRAMMING .<\/p>\n<p>1.1. Basic concepts of object-oriented programming.<\/p>\n<p>1.2. Delphi Integrated Development Environment : purpose and general description of the environment.<\/p>\n<p>1.3. General program organization in Delphi .<\/p>\n<p>1.4 Some reference information for working in the Delphi environment .<\/p>\n<p>SECTION 2. PRACTICAL WORK IN THE DELPHI ENVIRONMENT. LABORATORY WORK NO. 1 . \"Building, Compiling, and Debugging a Simple Application.\"<\/p>\n<p>LABORATORY WORK NO. 2. \"Creating a real division application\".<\/p>\n<p>LABORATORY WORK NO. 3. \"Acquaintance with the RadioGroup and CheckBox components , processing of strings of type String \".<\/p>\n<p>LABORATORY WORK NO. 4. \" Creation and processing of a linear array.\"<\/p>\n<p>LABORATORY WORK NO. 5. \" Using the StringGrid component to represent two-dimensional arrays.\"<\/p>\n<p>LABORATORY WORK NO. 6. \"File processing\".<\/p>\n<p>LABORATORY WORK NO. 7. \"Creating a simple text application (Multi-window text editor)\".<\/p>"}],
"keywords":[
]}