{
"id":17,
"guid":"3226FCB8DA18EE118C5C32A5A9F17050",
"pagename":"TMS-WEB-Core-Webanwendungen-mit-Delphi-entwickeln.html",
"datalevel":8,
"dataversion":1,
"name":"TMS WEB Core: Webanwendungen mit Delphi entwickeln",
"lang":"de",
"pubdate":"20200303",
"isbn13":"9781090700827",
"website":"https:\/\/flixengineering.com\/archives\/1266",
"authors":[
{
"id":13,
"guid":"9A22FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Dr-Holger-Flick.html",
"datalevel":6,
"dataversion":1}],
"publishers":[
{
"id":5,
"guid":"F21EFDB8DA18EE118C5C32A5A9F17050",
"pagename":"FlixEngineering.html",
"datalevel":4,
"dataversion":1,
"label":"FlixEngineering"}],
"descriptions":[
{
"guid":"BE26FCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"de",
"text":"Lernen Sie in diesem Buch die zahlreichen Möglichkeiten der Softwareentwicklung mit TMS WEB Core kennen.\n\nSeit mehr als zwei Jahrzehnten ist die Programmiersprache Delphi bekannt für die schnelle Anwendungsentwicklung von Windows Anwendungen. Insbesondere die einfache Erstellung von Desktop-Datenbankanwendungen und die unkomplizierte Bereitstellung der Anwendungen auf Kundensystemen machten Delphi gegenüber anderen Programmiersprachen populär. Seit einigen Jahren kann Software für die Zielplattformen Linux und MacOS sowie die mobilen Betriebssysteme iOS und Android erstellt werden.\n\nMit TMS WEB Core können seit Anfang 2018 moderne Webanwendungen mit Delphi programmiert werden, die vollständig im Webbrowser ausgeführt werden, da die programmierten Anwendungen in JavaScript übersetzt werden.\n\nAusführliche Beschreibung der Grundlagen, der Funktionsweise und des Transpilers (basierend auf pas2js),\nSchrittweise Erstellung der ersten Webanwendung,\nProgressive Web Applications (PWA) zur Offline-Nutzung,\nElectron Anwendungen: Erstellen Sie plattformübergreifende Desktopanwendungen basierend auf Webanwendungen,\nEinbinden von JavaScript und JavaScript-Komponenten,\nErstellen von Webservices für Datenbanken mit TMS XData,\nEinbinden von Datenbanken mit TDataset-Komponenten,\nXData-spezifische Funktionalität bei der Nutzung in Webanwendungen,\nResponsives Webdesign (Formulardesigner, HTML, CSS, Bootstrap),\nAbschließendes Kapitel mit umfassendem und praxisnahem Beispiel mit Server- und Webanwendung mit Google Maps und Google Charts.\nDie Inhalte sind sowohl für Einsteiger als auch für fortgeschrittene Entwickler geeignet, die sich für die Erstellung von Webanwendungen mit TMS WEB Core interessieren. Vorausgesetzt werden Kenntnisse der Programmiersprache Delphi (Object Pascal) und der Visuellen Komponenten Bibliothek (VCL). Zum Reproduzieren der zahlreichen Beispiele benötigen Sie eine aktuelle Version von Delphi und TMS WEB Core. Die kostenfreie Delphi Community-Edition ist ausreichend sowie die Testversion von TMS WEB Core."}],
"tocs":[
],
"keywords":[
]}