{
"guid":"3D59573216344174B34D028B2886F48E",
"pagename":"Delphi-High-Performance-Second-Edition.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Delphi High Performance - Second Edition",
"lang":"en",
"pubdate":"20230630",
"isbn10":"1805125877",
"isbn13":"9781805125877",
"website":"https:\/\/www.packtpub.com\/product\/delphi-high-performance-second-edition\/9781805125877",
"authors":[
{
"id":7,
"guid":"2213FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Primoz-Gabrijelcic.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true}],
"publishers":[
{
"id":2,
"guid":"1A0BFDB8DA18EE118C5C32A5A9F17050",
"pagename":"Packt.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"Packt"}],
"descriptions":[
{
"guid":"DB040B10D60241B98B2E6B1A659992AC",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"Performance matters! Users hate to use programs that are not responsive to interactions or run too slow to be useful. While becoming a programmer is simple enough, you require dedication and hard work to achieve an advanced level of programming proficiency where you know how to write fast code. This book begins by helping you explore algorithms and algorithmic complexity and continues by describing tools that can help you find slow parts of your code. Subsequent chapters will provide you with practical ideas about optimizing code by doing less work or doing it in a smarter way. The book also teaches you how to use optimized data structures from the Spring4D library, along with exploring data structures that are not part of the standard Delphi runtime library. The second part of the book talks about parallel programming. You’ll learn about the problems that only occur in multithreaded code and explore various approaches to fixing them effectively. The concluding chapters provide instructions on writing parallel code in different ways – by using basic threading support or focusing on advanced concepts such as tasks and parallel patterns. By the end of this book, you’ll have learned to look at your programs from a totally different perspective and will be equipped to effortlessly make your code faster than it is now."}],
"tocs":[
],
"keywords":[
]}