{
"id":96,
"url":"",
"guid":"60C0FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Pascal-at-Work-and-Play-An-Introduction-to-Computer-Programming-in-Pascal.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Pascal at Work and Play: An Introduction to Computer Programming in Pascal",
"lang":"en",
"pubdate":"19820101",
"thumb":"",
"isbn10":"0412233800",
"isbn13":"9780412233807",
"website":"",
"cover":"",
"cover_100w":"",
"cover_150w":"",
"cover_200w":"",
"cover_300w":"",
"cover_400w":"",
"cover_500w":"",
"cover_100h":"",
"cover_200h":"",
"cover_300h":"",
"cover_400h":"",
"cover_500h":"",
"cover_100x100":"",
"cover_200x200":"",
"cover_300x300":"",
"cover_400x400":"",
"cover_500x500":"",
"cover_130x110":"",
"authors":[
{
"id":71,
"url":"",
"guid":"06C0FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Richard-Forsyth.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true,
"name":""}],
"publishers":[
{
"id":31,
"url":"",
"guid":"2E8DFDB8DA18EE118C5C32A5A9F17050",
"pagename":"Chapman-and-Hall.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"Chapman and Hall"}],
"descriptions":[
{
"guid":"ECC0FCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"This is both a first and a second level course in Pascal. It starts at an elementary level and works up to a point where problems of realistic complexity can be tackled. It is aimed at two audiences: on the one hand the computer professional who has a good knowledge of Cobol or Fortran but needs convincing that Pascal is worth learning, and on the other hand the amateur computer enthusiast who may have a smattering of Basic or may be an absolute beginner. Its approach is based on two principles that are not always widely recognized. The first is that computing is no longer a specialist subject. In the early days of computing a priesthood arose whose function was to minister to those awesome, and awesomely expensive, machines. Just as in the ancient world, when illiteracy was rife, the scribes formed a priestly caste with special status, so the programmers of yesteryear were regarded with reverence. But times are changing: mass computer- literacy is on its way. We find already that when a computer enters a classroom it is not long before the pupils are explaining the finer points of its use to their teacher - for children seem to have greater programming aptitude than adults. This book, it is hoped, is part of that process of education by which the computer is brought down to earth; and therefore it attempts to divest computing of the mystique (and deliberate mystification) that still tends to surround the subject."}],
"tocs":[
],
"keywords":[
]}