{
"id":141,
"guid":"859DB2E12DD847A7ACC9777CCA1938D6",
"pagename":"Delphi-in-all-its-glory-part-2-Reaching-for-the-Gods.html",
"datalevel":7,
"dataversion":1,
"name":"Delphi, in all its glory (part 2) : Reaching for the Gods",
"lang":"en",
"pubdate":"20240131",
"isbn13":"9798878103749",
"website":"https:\/\/gabrielmoraru.com\/publications-citations\/the-delphi-in-all-its-glory-2-book\/",
"authors":[
{
"id":51,
"guid":"A08AFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Gabriel-Moraru.html",
"datalevel":7,
"dataversion":1}],
"publishers":[
],
"descriptions":[
{
"guid":"68E62CF157544D4BAF4C2CCC219545FF",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"<p>Whether you’re a curious novice venturing into the world of coding for the first time or already the user of a different programming language, this book is your gateway to Delphi coding.<br\/><br\/><a href=\"Delphi-in-all-its-glory.html\">The first book<\/a> concentrates on the exploration of the Delphi language. It doesn’t matter if you never wrote a line of code – we will start from ground zero, but the process will be faster if you already have done some programming in other languages.<br\/><br\/>Even if you are a (young) Delphi programmer, you could still learn a few tricks from the first book (check the summary).<br\/>If you are an old-school Pascal programmer that was always afraid to switch to objects, I promise, this is THE BOOK for you!<br\/><br\/>The second book is for the more seasoned developer aiming to enhance their craft and concentrates on the more advanced topics, such as libraries and architecture design, compiler’s and debugger’s inner working, proper exception handling and most important safer code.<br\/><br\/><b>What will you learn from this book?<\/b><br\/><br\/>This is not the regular “programmer’s manual” kind of book where I show you the basics of programming and keep circling around stupid-simple code examples. While I do kick-start you into programming, the main purpose of this book is to take you to the “meta” level of programming and even deep beyond that. But while study the language as regular, mere programmers, we will learn in the background how to build stable programs through reliable code, how to avoid typical programming pitfalls, why some programming concepts are safer than others, how to turn mondain Delphi features into an error-prevention system…<br\/><br\/>A second purpose of this book is also to demonstrate that Delphi is the best tool if you want to develop:<br\/><br\/>Good looking GUI applications<br\/>Cross-platform applications<br\/>Fast applications (for example data-processing, games)<br\/>Business and scientific applications<br\/><br\/>In parallel with all the above, we will compare Delphi with other languages (mostly C++, C#, R, Java, and Python) to see their merits and pitfalls and to reassure you that Delphi is THE language for you.<br\/>I will never ask you in this book to just believe me. I will always try to present hard evidence – scientific articles, proved concepts, read code examples, benchmark tests.<br\/><br\/>Even if the stakes are high, I promise it will NOT be a bumpy road. The learning curve might be steep in some places, but the book is peppered with code examples, case studies and diagrams that will explain the concepts we study.<br\/><br\/><b>Book layout<\/b><br\/><br\/>In the first book we have seen what kind of applications we can do with Delphi, then we dived quite deep into the Delphi language and object-oriented programming, and we saw what is safe to do and what is not, and most important, why. And in the background, we learned about high quality code, because in the end this is the ultimate goal if you want to more reach the Gods of programming.<br\/>The “safety first” concept will be strengthened in this book where continue to learn about code reliability, designing sound architectures and preemptive programming. All this, while studying in foreground advanced concepts such as debugging, memory management, proper exception-handling, etc. Oh boy… we will have fun!&nbsp;<\/p>"}],
"tocs":[
{
"guid":"0209DC9B88EC4979B3E8780DABDBF30F",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"<p>1.\tOverview<br\/><\/p><p>Intended Audience<br\/>What will you learn from this book?<br\/>Book layout<br\/>Who am I?<br\/>How is this book written?<br\/>Environment-responsible<br\/>Pre-requisites for this book<br\/>Let’s start<br\/><br\/>2.\tTable of content<br\/><br\/>3.\tThe Delphi compiler<br\/><br\/>What is a compiler? What is an interpreter?<br\/>Compiled vs interpreted<br\/>A reliable compiler<br\/>The toolchain<br\/>Executable size<br\/>Compiler speed<br\/>From Pas to Exe<br\/>The compilation order<br\/>Compiling and running the program<br\/>DCUs<br\/>Debug vs Release DCUs<br\/>The linker<br\/>Compile vs Build<br\/>Improving compiler’s speed<br\/>Remove unused units<br\/>Rearrange the units in the uses section<br\/>Unused paths<br\/><br\/>4.\tLibraries<br\/><br\/>Why do we need libraries?<br\/>Libraries are not for everyone<br\/>The four rules of creating packages<br\/>Library architecture<br\/>Circular references<br\/>It is all about aliens and pyramids<br\/>The anatomy of a package<br\/>DPK<br\/>BPL\/DCP<br\/>Project groups<br\/>Compiler Directives<br\/>Delphi’s framework<br\/>The RTL library<br\/>The VCL library<br\/>Library paths<br\/>Environment variables<br\/>Compiling with multiple Delphi versions<br\/>Finding files via Library paths<br\/>Search Paths<br\/>Under-development libraries<br\/>Global vs local paths<br\/>Precompiled files<br\/>Precompiling our own files<br\/>The “Package\/DCP\/HPP output directory” fields<br\/>Project Paths<br\/>Recap<br\/>How to install a library?<br\/>Installing a library manually<br\/>Single-file libraries<br\/>What to do when things go south?<br\/>Library folder structure<br\/>Installing libraries via Setup<br\/>Creating our own installer<br\/>IDE plugins<br\/>Installing libraries via GetIt<br\/>How to uninstall a library<br\/>Runtime\/Designtime libraries<br\/>Run-time libraries<br\/>Design time libraries<br\/>Design time vs Runtime<br\/>Including a library in our project<br\/>Linking with runtime packages<br\/>Drawbacks<br\/>How does the linker optimize unused code?<br\/>Experiment calibration<br\/>Proceedings<br\/>Extension to the experiment<br\/>Debugging 3rd party libraries<br\/>Recompiling parts of the VCL<br\/>Why libraries are mandatory for large projects?<br\/>Logic separation<br\/>The Chaos of Monolithic Projects<br\/>The Breaking Point<br\/>The Refractory Ignition Spark<br\/>A Better Way: Modular Code via Libraries<br\/>Overcoming Preconceptions<br\/>Using C\/++ libraries in Delphi<br\/>When you have the source code<br\/>When you have the DLL<br\/>Popular libraries<br\/>LightSaber<br\/>Proteus<br\/>About libraries and licenses<br\/>Meaning of the fields<br\/>Discussions<br\/>Conclusions<br\/>More details<br\/>The Initialization of packages<br\/>The Register procedure<br\/>Building our own visual components<br\/>5.\tAutomatic compilation<br\/><br\/>Using MSBuild in Delphi<br\/><br\/>6.\tThe debugger<br\/><br\/>What is a debugger?<br\/>Preparing our project for debugging<br\/>Stacks<br\/>Configurations<br\/>The “Compiling” page<br\/>The “Use debug DCUs” field<br\/>Other settings<br\/>A picture is worth a thousand words.<br\/>The “Linking” page<br\/>The “Debug source path” field<br\/>Breakpoints<br\/>Breakpoint properties<br\/>Relocate the execution point manually<br\/>Finally, ready to debug<br\/>Starting the program under the debugger<br\/>Debugging from a crash point<br\/>Cannot debug?<br\/>Fun stuff to do during debugging<br\/>Hint for geeks<br\/>Debugging cheat sheet<br\/><br\/>7.\tRemote debugging<br\/><br\/>How does it work?<br\/>Install PAserver (on the remote machine)<br\/>Run PAServer (on the remote machine)<br\/>Configure the environment (locally)<br\/>Assign a Connection Profile to the Delphi project<br\/>Choose which files to deploy<br\/>Deploying the files manually<br\/>Start debugging<br\/>Stability<br\/><br\/>8.\tAutomatic bug logging &amp; reporting<br\/><br\/>MadShi MadExcept<br\/>EurekaLog<br\/><br\/>9.\tAdvanced debugging techniques<br\/><br\/>Method 1: Attach to process<br\/>Method 2: Debug with “Run -&gt; Load process”.<br\/>Method 3: Host application (Recommended)<br\/>Method 4: External tools<br\/>Method 5: Start Delphi in “safe” mode<br\/>Method 6: Use external tools<br\/>Stupid Windows 10<br\/><br\/>10.\tSpeed up your program<br\/><br\/>Profiling your program<br\/>Home-brewed method (as cheap as the home-made beer)<br\/>Third party profilers (aka non-free)<br\/>Improving the speed<br\/>Record field alignment<br\/>CPU Optimization<br\/>Compared to Julia<br\/><br\/>11.\tCompiler! Please save my ass!<br\/><br\/>Overflow checking<br\/>IO checking<br\/>Range Checking<br\/>Enabling Runtime Error Checking<br\/>Temporary disabling range checking<br\/>Assertions<br\/>Assert vs Raise<br\/>Nothing comes for free<br\/><br\/>12.\tMemory management<br\/><br\/>FastMM<br\/>1. Dramatic speed increase for memory-bound operations<br\/>2. Prevents memory fragmentation<br\/>3. Better memory sharing<br\/>4. Safer code<br\/>5. No more access violations<br\/>Switching FastMM to Full Debug Mode<br\/>How to read a FastMM leak report?<br\/>The summary<br\/>Leaked blocks<br\/>Advanced topics<br\/>You create it, you kill it<br\/>Memory ownership<br\/>Dangling references<br\/>Alice loses her preferred book<br\/>Getting our dirty paws on a dangling reference<br\/>The root of all evil<br\/>There are even worst scenarios<br\/>Do some noise<br\/>Bruce Willis (and FastMM) saves the day… again!<br\/>Garbage collectors<br\/>About ownership<br\/>Passing the ownership around<br\/>Summary<br\/><br\/>13.\tExceptions<br\/><br\/>Exception Handling<br\/>Let’s do the “What this code does” game<br\/>Amateur mistake<br\/>Keep it real<br\/>Spit, don't swallow<br\/>Good boy, Debugger!<br\/>Ignoring exceptions during debugging<br\/>Try\/Finally vs Try\/Except<br\/>Raising exceptions<br\/><br\/>14.\tWindows Messages in Delphi<br\/><br\/>The Windows Messaging System<br\/>Message Handlers in Delphi<br\/>Practical Examples<br\/><br\/>15.\tProgrammer’s toolbox<br\/><br\/>Delphi registry secrets<br\/>Restoring the registry<br\/>How to start a “mint” Delphi instance?<br\/>Total Commander<br\/>SoftPerfect RAMDisk<br\/>Version control<br\/>Do we need a repository?<br\/>Creating a new Tortoise repository<br\/>Revisions<br\/>Resolving Conflicts<br\/>Commit Progress<br\/>Icon overlays<br\/>Shelving<br\/>Normalizers<br\/><br\/>16.\tCode safety<br\/><br\/>Things that are ok, but dangerous<br\/>Don't use pointers<br\/>Don’t do direct typecasts<br\/>Avoid threads<br\/>Avoid TTimer<br\/>Avoid using unsafe functions<br\/>Things related to the Delphi language<br\/>Use strong typing<br\/>Avoid “with”<br\/>Use assertions. Abundantly<br\/>Document your code<br\/>Follow coding standards<br\/>Extra care with Interfaces<br\/>Perform boundary checks<br\/>Avoid using unsafe functions<br\/>Handling Boundary Values<br\/>Dealing with Wrapping<br\/>Simply “don’t do it”<br\/>Don’t swallow exceptions<br\/>Don't use Application.ProcessMessages<br\/>Letting the compiler to help us<br\/>Activate rage checking<br\/>Activate I\/O checking<br\/>Activate integer overflow<br\/>Activate compiler hints and warnings<br\/>Other runtime checks<br\/>Enable FastMM to check for memory leaks<br\/>Implement \"safety net\" for enumerations<br\/>Use Free instead of FreeAndNil<br\/>Extra techniques<br\/>Test program thoroughly<br\/>Implement Unit Testing for your code.<br\/>Use a bug tracking tool, like MadShi!<br\/>External libraries<br\/>Encapsulate your code<br\/>Cheat sheet<br\/>Quantify the source of errors<br\/>Classification of error types:<br\/>Program architecture<br\/>Extra stuff to check for<br\/>On FreeAndNil<br\/>A word of warning on Application.ProcessMessages<br\/>TControl.Perform<br\/>Safely storing a list of objects<br\/>Security update 2024<br\/><br\/>17.\tAdvance topics<br\/><br\/>Running a single instance of our program<br\/>How does it work?<br\/>Let’s see the code<br\/>Anonymous methods<br\/>Capture of Variables<br\/>Usage<br\/>Flexible Usage<br\/>Inline Definitions<br\/>Analyzing the code above<br\/>Multithreading in Delphi<br\/>Delphi's Multithreading Infrastructure<br\/>Creating Threads with TThread<br\/>Thread Safety<br\/>Synchronization with the Main GUI Thread<br\/>Using TThread.Synchronize<br\/>Using TThread.Queue<br\/>Other synchronization mechanisms:<br\/>Best Practices for Multithreading<br\/>1. Plan Your Multithreading Strategy<br\/>2. Handle Exceptions Gracefully<br\/>3. Minimize Shared Data<br\/>Common Pitfalls to Avoid<br\/>Delphi Parallel Programming Library (PPL)<br\/>Hardware limitations<br\/><br\/>18.\tMigrating 32-bit Code to 64-bit: Best Practices and Considerations<br\/><br\/>Alternative paths<br\/>How to set the LARGE_ADDRESS_AWARE?<br\/>Before you start<br\/>Upgrading Third-Party Libraries<br\/>Adding 64-bit Support to the Project<br\/>Fixing the paths<br\/>Inspecting the code<br\/>Choosing the correct data types<br\/>Typecast from pointer to integer<br\/>Typecast between Record and TObject<br\/>WinAPI issues<br\/>SendMessage<br\/>Vcl.Controls.TControl.Perform<br\/>SetWindowLong\/ GetWindowLong<br\/>SetWindowLong:<br\/>SetWindowLongPtr:<br\/>Special types<br\/>Avoid using LongInt<br\/>Extended type<br\/>Inline ASM code<br\/>Functions that return Cardinal<br\/>Summary<br\/><br\/>19.\tDeploying our application on other platforms<br\/><br\/>Android<br\/>Apple<br\/>Linux<br\/>Summary<br\/><br\/>20.\tBeing a programmer<br\/><br\/>Change is good… but hard<br\/>On Technical Debt<br\/>Rocking the boat<br\/>So, do you still want to do it?<br\/><br\/>21.\tAll good things must come to an end<br\/><br\/>Where do you go from here?<br\/>Delphi sample projects<br\/>Your next big project could be a game<br\/>About Stack Overflow<br\/>Fighting bullies on Stack Overflow<br\/>Ask the artificial intelligence<br\/>Video tutorials<br\/>Books<br\/>My books<br\/>Already published books:<br\/>What I have learned in the last 25 years of software development<br\/><br\/>22.\tNotes and credits<br\/><br\/>Contact me!<br\/>Disclaimer<br\/>Source code<br\/>Be environment-responsible<br\/>Credits&nbsp;<\/p>"}],
"keywords":[
]}