{
"id":16,
"guid":"AC24FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Hands-on-with-Delphi-Volume-2.html",
"datalevel":8,
"dataversion":1,
"name":"Hands-on with Delphi - Volume 2",
"lang":"en",
"pubdate":"20200826",
"isbn13":"9798643845973",
"website":"https:\/\/flixengineering.com\/archives\/1394",
"authors":[
{
"id":13,
"guid":"9A22FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Dr-Holger-Flick.html",
"datalevel":6,
"dataversion":1}],
"publishers":[
{
"id":5,
"guid":"F21EFDB8DA18EE118C5C32A5A9F17050",
"pagename":"FlixEngineering.html",
"datalevel":4,
"dataversion":1,
"label":"FlixEngineering"}],
"descriptions":[
{
"guid":"2E25FCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"Learn to build modern Delphi applications for multiple platformswith maps and geographic focus by example!\n\nDelphi comes with native compilers for Windows, Linux, Apple macOS, iOS, and Android. TMS Software has been offering software components and products specifically designed for Delphi developers since the first version of Delphi. From recent seminars, conferences, and events, TMS realized that practical examples how to make use of their components and products have the greatest learning effect. This idea led to the Hands-on series. In this second book, applications that make use of FNC Maps are front and center. It is a new component-based framework to access mapping and other geographic services from Google Maps, TomTom, Microsoft Bing Maps, Microsoft Azure, Mapbox, Here, and OpenLayers. Be it in the VCL, FireMonkey, or LCL, using the framework is as easy as dropping a component on your form. It delivers Rapid Application Development at its best. All topics are explained with examples that can be transferred to your specific use case easily.\n\nGet to know the FNC framework, FNC Core, and FNC Maps in a nutshell.\nLearn about FNC Maps in detail: You will find dozens of hands-on examples from installation to modern multi-tier applications with large databases, web services, web, and desktop clients.\nAnnotate maps and visualize data using markers with clustering, lines, shapes, pop-up windows and routes.\nBuild applications that can handle any geographical data and interact with other Geographic Information Services (GIS). Load GPX tracks from GPS devices, GeoJSON shapes, and Google Earth-specific KML layers.\nInclude other mapping services to get directions with turn-by-turn instructions, to geocode addresses, and to determine your geolocation.\nCreate reports with a customizable template based on data from maps and databases.\nAllow users to freely customize maps using events or interactive markers and shapes.\nExamples use TMS FlexCel, FNC Core, VCL UI Pack, WEB Core, Cryptography Pack, and XData. Embarcadero Delphi Sydney 10.4 or newer suggested. Trial versions and free developer accounts of service providers suffice to run the examples. SQLite database examples are ready for use without server setup. Basics for reporting, web, and XData explained in “TMS WEB Core: Web Application Development with Delphi” and previous Hands-On titles are not included again but referenced."}],
"tocs":[
],
"keywords":[
]}