{
"id":65,
"guid":"AC8DFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Delphi-Concurrent-developments-guide-for-iOS-and-Android-Vol1.html",
"datalevel":10,
"dataversion":1,
"name":"Delphi - Concurrent developments guide for iOS and Android Vol1: Development environment construction guide - From start to build Mastering DELPHI",
"lang":"jp",
"pubdate":"20200229",
"website":"https:\/\/amzn.to\/3mi8yax",
"authors":[
{
"id":54,
"guid":"3E8DFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Ano-Maki.html",
"datalevel":6,
"dataversion":1}],
"publishers":[
{
"id":7,
"guid":"682BFDB8DA18EE118C5C32A5A9F17050",
"pagename":"Amazon-Kindle.html",
"datalevel":4,
"dataversion":1,
"label":"Amazon"}],
"descriptions":[
{
"guid":"2E8EFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"<p>Mobile app development is now an integral part of any business. In the past, it took a lot of time and money to support both iOS and Android devices such as the iPhone. However, Delphi allows you to create apps that work in two different mobile environments with almost the same code. This means a significant cost savings. Furthermore, the screen can be created intuitively with the GUI, and the handling of variables is as simple and clear as a general program language. It already has the various features you need for mobile, and it's easy to add features.<\/p>\n<p>This book was written to help business users who are considering deploying Delphi for mobile development do the validation without spending money and time.<br>\nIn addition, it enables individual developers and hobby programmers who want to develop mobile apps at the lowest possible cost to build a development environment smoothly in a short time. You can avoid the stumbling blocks that often occur with the introduction of Delphi and start programming comfortably.<\/p>\n<p>Delphi saves time! Easy! Cost saving! !!<\/p>\n<p>Note) This book is not a manual about language grammar and basic operation methods.<\/p>"
},{

"guid":"568EFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"fr",
"text":"Le développement d'applications mobiles fait désormais partie intégrante de toute entreprise. Dans le passé, il fallait beaucoup de temps et d'argent pour prendre en charge les appareils iOS et Android tels que l'iPhone. Mais avec presque le même code, Delphi vous permet de créer des applications qui fonctionnent dans deux environnements mobiles différents. Cela signifie des économies de coûts significatives. De plus, l'écran peut être créé intuitivement avec l'interface graphique, et la gestion des variables est aussi simple et claire qu'un langage de programmation général. Il dispose déjà des différentes fonctionnalités dont vous avez besoin pour mobile et il est facile d'ajouter des fonctionnalités.\n\nCe livre a été écrit pour aider les utilisateurs professionnels qui envisagent de déployer Delphi pour le développement mobile à le vérifier sans perdre de temps et d'argent.\nEn outre, il permet aux développeurs individuels et aux amateurs qui souhaitent développer des applications mobiles au coût le plus bas possible de créer un environnement de développement en douceur en peu de temps. Vous pouvez commencer à programmer confortablement, en évitant les obstacles qui se produisent souvent avec l'introduction de Delphi.\n\nDelphi fait gagner du temps! Facile! Réduction des coûts! !!\n\nNote) Ce livre n'est pas un manuel sur la grammaire du langage et les méthodes de fonctionnement de base."
},{

"guid":"7E8EFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"jp",
"text":"<p>モバイルアプリ開発は今やあらゆるビジネスに必須の要素です。これまではiPhoneなどのiOSとAndroidの両デバイスに対応するために多くの時間やコストが必要でした。しかしDelphiはほとんど同一のコードで、２種類のモバイル環境で動作するアプリを作成することができます。これはコストの大幅な節約を意味します。さらにGUIで画面を直感的に作成でき、変数の扱いも一般的なプログラム言語と同様に単純明解です。モバイルに必要な様々な機能が既に組み込まれていますし、機能を追加するのも容易です。<\/p>\n<p>本書はモバイル開発のためにDelphiの導入を検討しているビジネスユーザが、お金と時間をかけずに検証を行う一助として書かれました。<br>\nさらに、できるだけローコストでモバイルアプリを開発したいと考えている個人開発者、趣味のプログラマが、短時間でスムーズに開発環境を構築するのを可能にします。Delphiの導入で起きがちなつまずきを避け、快適にプログラミングを始めることができます。<\/p>\n<p>Delphiは時短！簡単！省コスト！！<\/p>\n<p>注）この書籍は言語文法や基本操作方法についての解説書ではありません。<\/p>"}],
"tocs":[
{
"guid":"A68EFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"<p>1. Delphi Advantages<\/p>\n<p>2. Create a development environment<br>\n(1) What you need<br>\n(2) Installation of standard tools<br>\n(3) Install Delphi itself<br>\n(4) Install the patch<\/p>\n<p>3. Preparing for mobile development<br>\n(1) Settings for Android<br>\n(2) Mac settings<br>\n(3) Connect a mobile device (iPhone, iPad) to your Mac<br>\n(4) Temporarily generate an app with Xcode<br>\n(5) About Apple's developer registration<br>\n(6) About lifting restrictions on execution on iOS devices<br>\n(7) Link setting with Mac<\/p>\n<p>4. Build and check the operation of the app<br>\n(1) Creating an Android application<br>\n(2) Creating an iOS app<\/p>\n<p>After the build<\/p>"
},{

"guid":"CE8EFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"fr",
"text":"1. Avantage Delphi\n2. Créer un environnement de développement\n(1) Ce dont vous avez besoin\n(2) Installation d'outils standards\n(3) Installez Delphi lui-même\n(4) Installez le patch\n3. Préparation au développement mobile\n(1) Paramètres pour Android\n(2) Paramètres Mac\n(3) Connectez un appareil mobile (iPhone, iPad) à votre Mac\n(4) Générer temporairement une application avec Xcode\n(5) À propos de l'enregistrement des développeurs Apple\n(6) À propos de la levée des restrictions d'exécution sur les appareils iOS\n(7) Paramètres de liaison avec Mac\n4. Construisez et vérifiez le fonctionnement de l'application\n(1) Créer une application Android\n(2) Création d'une application iOS\nAprès la construction"
},{

"guid":"F68EFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"jp",
"text":"<p>1. Delphiのアドバンテージ<\/p>\n<p>2. 開発環境を作成する<br>\n（1）必要なもの<br>\n（2）標準ツールのインストール<br>\n（3）Delphi本体をインストールする<br>\n（4）パッチをインストールする<\/p>\n<p>3. モバイル開発の準備<br>\n（1）Androidのための設定<br>\n（2）Macの設定<br>\n（3）Macにモバイルデバイス(iPhone、iPad)をつなぐ<br>\n（4）Xcodeでアプリを仮生成する<br>\n（5）Appleの開発者登録について<br>\n（6）iOSデバイスでの実行制限の解除について<br>\n（7）Macとの連携設定<\/p>\n<p>4. アプリのビルドと動作確認<br>\n（1）Androidアプリの作成<br>\n（2）iOSアプリの作成<\/p>\n<p>ビルドを終えて<\/p>"}],
"keywords":[
]}