{
"id":18,
"guid":"D627FCB8DA18EE118C5C32A5A9F17050",
"pagename":"TMS-WEB-Core-Web-Application-Development-with-Delphi.html",
"datalevel":8,
"dataversion":1,
"name":"TMS WEB Core: Web Application Development with Delphi",
"lang":"en",
"pubdate":"20200326",
"isbn13":"9798615692895",
"website":"https:\/\/flixengineering.com\/archives\/1290",
"authors":[
{
"id":13,
"guid":"9A22FCB8DA18EE118C5C32A5A9F17050",
"pagename":"Dr-Holger-Flick.html",
"datalevel":6,
"dataversion":1}],
"publishers":[
{
"id":5,
"guid":"F21EFDB8DA18EE118C5C32A5A9F17050",
"pagename":"FlixEngineering.html",
"datalevel":4,
"dataversion":1,
"label":"FlixEngineering"}],
"descriptions":[
{
"guid":"6C28FCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"lang":"en",
"text":"Discover the endless possibilities of software development with TMS WEB Core ...\n\nFor more than two decades, the development environment Delphi is known for the rapid programming of Windows applications. Especially the easy creation of desktop database applications and the uncomplicated deployment of the applications to customer systems made Delphi popular compared to other programming languages. For several years now, software can be created for the target platforms Linux, MacOS as well as the mobile operating systems iOS and Android.\n\nWith TMS WEB Core, modern web applications can be programmed with Delphi since the beginning of 2018. These applications can be executed completely in the web browser because they are translated into JavaScript.\n\nDetailed description of the basics, the functionality, and the transpiler (based on pas2js)\nStep-by-step creation of the first web application\nProgressive Web Applications (PWA) for offline use\nElectron applications: Cross-platform Desktop applications based on web applications\nIntegration of JavaScript classes and controls\nCreating web services for databases with TMS XData\nIntegration of databases with TDataset controls\nXData-specific functionality for use in web applications\nResponsive web design (form designer, HTML, CSS, Bootstrap)\nThe final chapter provides a comprehensive and practical example of server and web application with Google Maps and Google Charts\nThe content is suitable for both beginners and advanced developers interested in creating web applications with TMS WEB Core.\n\nKnowledge of Delphi (Object Pascal) and the Visual Component Library (VCL) is required. To reproduce the numerous examples, you need a current version of Delphi and TMS WEB Core.\n\nThe free Delphi Community Edition is sufficient as well as the trial version of TMS WEB Core."}],
"tocs":[
],
"keywords":[
]}