{
"id":11,
"url":"",
"guid":"DC1CFCB8DA18EE118C5C32A5A9F17050",
"pagename":"Introducing-Delphi-ORM.html",
"datalevel":8,
"dataversion":1,
"ispagetobuild":true,
"name":"Introducing Delphi ORM",
"lang":"en",
"pubdate":"20190802",
"thumb":"",
"isbn10":"",
"isbn13":"9781484250129",
"website":"https:\/\/www.apress.com\/fr\/book\/9781484250129",
"cover":"",
"cover_100w":"",
"cover_150w":"",
"cover_200w":"",
"cover_300w":"",
"cover_400w":"",
"cover_500w":"",
"cover_100h":"",
"cover_200h":"",
"cover_300h":"",
"cover_400h":"",
"cover_500h":"",
"cover_100x100":"",
"cover_200x200":"",
"cover_300x300":"",
"cover_400x400":"",
"cover_500x500":"",
"cover_130x110":"",
"authors":[
{
"id":11,
"url":"",
"guid":"461CFCB8DA18EE118C5C32A5A9F17050",
"pagename":"John-Kouraklis.html",
"datalevel":6,
"dataversion":1,
"ispagetobuild":true,
"name":""}],
"publishers":[
{
"id":1,
"url":"",
"guid":"FA16FDB8DA18EE118C5C32A5A9F17050",
"pagename":"Apress.html",
"datalevel":4,
"dataversion":1,
"ispagetobuild":true,
"label":"Apress"}],
"descriptions":[
{
"guid":"541DFCB8DA18EE118C5C32A5A9F17050",
"pagename":"",
"datalevel":3,
"dataversion":1,
"ispagetobuild":true,
"lang":"en",
"text":"Discover the fundamental concepts of object-relational mapping (ORM) design, Aurelius’ basic features, and the practical applications of those features. In a series of tasks, you will be exposed to techniques and best practices that make the use of Aurelius easy and efficient. Furthermore, you’ll refine your analytical skills to sharpen your understanding of Delphi (Pascal), helping you write better code along the way.  \nIntroducing Delphi ORM explains that while database design is difficult, database programming (i.e., manipulating, extracting, filtering, and manipulating data) is even more difficult. ORM frameworks provide a simpler way for you to access and manage data in databases. You’ll see how they offer different levels of abstraction and tools to code data access in a database-agnostic way by introducing a layer between the application and the data access language (SQL, LINQ, and so on).\nBy the end of the book, you will be confident in using a wide range of Aurelius features to allow you to get started with databases in a very short space of time.\n\nWhat You Will Learn\n\nGain the fundamentals of ORM frameworks and Aurelius for Delphi\nAchieve basic tasks, such as connecting to the database and adding, deleting, and updating records, using Aurelius \nEmploy advanced database queries \nUse the TAureliusDataSet component \nIntegrate with mobile platforms such as Android and iOS\nWork with the data modeler application\n\nWho This Book Is For \nSoftware developers starting with Aurelius or those who have some exposure to the framework."}],
"tocs":[
],
"keywords":[
]}